{
  "posts": [
    {
      "id": "1",
      "title": "json-server",
      "author": "typicode"
    }
  ],
  "comments": [
    {
      "id": "1",
      "body": "some comment",
      "postId": 1
    }
  ],
  "profile": {
    "name": "typicode"
  },
  "insurances": [
    {
      "company": "Britam Insuarance Company",
      "policy": "Long-Term Disability Insurance Most long-term disability insurance policies categorize disabilities as own occupation or any occupation. 1  Own occupation means the insured, due to disability, is unable to perform their regular job or a similar job. Any occupation means the insured, due to disability, is unable to perform any job for which they are qualified.",
      "issuedOn": "2024-12-02T21:00:00.000Z",
      "expiringOn": "2024-12-11T21:00:00.000Z",
      "status": "renew",
      "id": "1"
    },
    {
      "company": "AIG Insurance Company",
      "policy": "Life Insurance Life insurance protects the people who are financially dependent on you. If your parents, spouse, children, or other loved ones would face financial hardship if you died, you should place life insurance high on your list of priorities. Think about how much you earn each year (and the number of years you plan to remain employed), and purchase a policy to replace that income in the event of your untimely demise.",
      "issuedOn": "2024-12-04T21:00:00.000Z",
      "expiringOn": "2024-12-06T21:00:00.000Z",
      "status": "renew",
      "id": "2"
    },
    {
      "company": "Jubilee Insurance Company",
      "policy": " Health Insurance The soaring cost of medical care is reason enough to make health insurance a necessity. Even a simple visit to the family doctor can result in a hefty bill. More serious injuries that result in a hospital stay can generate a bill that tops the price of a one-week stay at a luxury resort. Injuries that require surgery can quickly rack up five-figure costs. 2  Although the cost of health insurance is a financial burden for just about everyone, the potential cost of not having coverage is much higher.",
      "issuedOn": "2024-12-06T21:00:00.000Z",
      "expiringOn": "2024-12-08T21:00:00.000Z",
      "status": "renew",
      "id": "3"
    },
    {
      "company": "APA Insurance Company",
      "policy": "Homeowners Insurance Replacing your home is an expensive proposition. Having the right homeowners insurance can make the process less difficult. When shopping for a policy, look for one that covers the replacement of the structure and the contents, in addition to the cost of living somewhere else while your home is repaired. ",
      "issuedOn": "2024-12-08T21:00:00.000Z",
      "expiringOn": "2024-12-10T21:00:00.000Z",
      "status": "renew",
      "id": "4"
    },
    {
      "company": "APA Insurance Company",
      "policy": ". Automobile Insurance Some level of automobile insurance is required by law in most places. Even if you are not required to have it, and you are driving an old clunker that has been paid off for years, automobile insurance is something you shouldn't skip. If you are involved in an accident and someone is injured or their property is damaged, you may be subject to a lawsuit that could cost you everything you own. Accidents happen quickly and the results are often tragic. Having no automobile insurance or purchasing only the minimum required coverage saves you only a tiny amount of money and puts everything else you own at risk.",
      "issuedOn": "2024-12-12T21:00:00.000Z",
      "expiringOn": "2024-12-14T21:00:00.000Z",
      "status": "renew",
      "id": "6"
    },
    {
      "company": "Britam Insuarance Company",
      "policy": "Term Assurance This policy offers protection only for a particular period which is agreed upon by the insurance company and insured. The insurance company will pay out the full sum assured if the insured passes away within the insurance period. There are no benefits that are payable if the insured is still alive when the policy matures. This is the simplest and most affordable form of life insurance since it provides life cover only with no investment benefits.",
      "issuedOn": "2024-12-14T21:00:00.000Z",
      "expiringOn": "2024-12-16T21:00:00.000Z",
      "status": "active",
      "id": "7"
    },
    {
      "company": "Jubilee Insurance Company",
      "policy": "Whole Life A whole life policy offers life-time protection to the insured. The insured selects how they would like to pay premiums. It could be throughout their life, you can choose to stop payment at a particular age (for example at 60), or you can choose to pay one single premium.",
      "issuedOn": "2024-12-16T21:00:00.000Z",
      "expiringOn": "2024-12-18T21:00:00.000Z",
      "status": "renew",
      "id": "8"
    },
    {
      "id": "9",
      "company": "Kennedy  compnay",
      "policy": "Health Insurance The soaring cost of medical care is reason enough to make health insurance a necessity. Even a simple visit to the family doctor can result in a hefty bill. More serious injuries that result in a hospital stay can generate a bill that tops the price of a one-week stay at a luxury resort. Injuries that require surgery can quickly rack up five-figure costs. 2 Although the cost of health insurance is a financial burden for just about everyone, the potential cost of not having coverage is much higher.",
      "issuedOn": "2024-12-01T21:00:00.000Z",
      "expiringOn": "2024-12-05T21:00:00.000Z",
      "status": "expired"
    }
  ]
}